DataProcessors/РаботаСКадрами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>РаботаСКадрами</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДоговорРаботыУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ДоговорРаботыУслуги</Name>
			<BasedOn>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановыеНачисленияПоДоговорам</xr:Item>
				<xr:Item>InformationRegister.УсловияДоговораГПХ</xr:Item>
				<xr:Item>InformationRegister.ПериодыДействияДоговоровГражданскоПравовогоХарактера</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаключенСоСтудентомРаботающимВСтудотряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОплатыПоДоговоруГПХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияЕСВ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЗастрахованныхЛицЕСВ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПрекращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДоговорАвторскогоЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ДоговорАвторскогоЗаказа</Name>
			<BasedOn>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановыеНачисленияПоДоговорам</xr:Item>
				<xr:Item>InformationRegister.УсловияДоговораГПХ</xr:Item>
				<xr:Item>InformationRegister.ПериодыДействияДоговоровГражданскоПравовогоХарактера</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВычета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАвторскогоДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоговоровАвторскогоЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОплатыПоДоговоруГПХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияЕСВ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЗастрахованныхЛицЕСВ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПрекращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/РаботаСКадрами/Forms/РаботаСКадрами/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//++ ЕРП ЗИК
//-- ЕРП ЗИК

	ЗначенияДляЗаполнения  = Новый Структура("Организация", "Организация");	
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = ЗарплатаКадры.ПерваяДоступнаяОрганизация();
	КонецЕсли; 
	
	СохраненныйСотрудник = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("РаботаСКадрами", "Сотрудник");
	Если СохраненныйСотрудник = Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Сотрудники.Ссылка
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники
			|
			|УПОРЯДОЧИТЬ ПО
			|	Сотрудники.Наименование";
			
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Сотрудник = Выборка.Ссылка;
		КонецЕсли; 
	Иначе
		Сотрудник = СохраненныйСотрудник;
	КонецЕсли; 
	
	УстановитьОтборЖурналовПоОрганизации();
	
	ПрочитатьДанныеСотрудника();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеДанныхФизическогоЛица" 
		И (Источник = ФизическоеЛицо ИЛИ Источник = Сотрудник) Тогда
		
		ПрочитатьДанныеСотрудника();
		
	ИначеЕсли ИмяСобытия = "ИзменениеДанныхМестаРаботы" 
		ИЛИ ИмяСобытия = "ДокументДоговорРаботыУслугиПослеЗаписи"
		ИЛИ ИмяСобытия = "ДокументДоговорАвторскогоЗаказаПослеЗаписи"
		ИЛИ ИмяСобытия = "ДокументНачальнаяШтатнаяРасстановкаПослеЗаписи" Тогда
		
		ОбновитьСписки(ЭтаФорма, Истина, Истина);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	ПрочитатьДанныеСотрудника();
	
	ПодключитьОбработчикОжидания("ПриИзмененииСохраняемойНастройки", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникАдресЭлектроннойПочтыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	УправлениеКонтактнойИнформациейКлиент.СоздатьЭлектронноеПисьмо("", ЭлектронныйАдрес);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НовыйСотрудник(Команда)
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаОбъекта", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСотрудникаВАрхив(Команда)
	
	ОтправитьСотрудникаВАрхивНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьПриемНаРаботу(Команда)
	СотрудникиКлиент.ОформитьНаОсновании(ЭтаФорма, Элементы.СотрудникиБезОтношений.ТекущаяСтрока, "Документы.ПриемНаРаботу");
КонецПроцедуры

&НаКлиенте
Процедура ОформитьДоговорРаботыУслуги(Команда)
	СотрудникиКлиент.ОформитьНаОсновании(ЭтаФорма, Элементы.СотрудникиБезОтношений.ТекущаяСтрока, "Документы.ДоговорРаботыУслуги");
КонецПроцедуры

&НаКлиенте
Процедура ОформитьДоговорАвторскогоЗаказа(Команда)
	СотрудникиКлиент.ОформитьНаОсновании(ЭтаФорма, Элементы.СотрудникиБезОтношений.ТекущаяСтрока, "Документы.ДоговорАвторскогоЗаказа");
КонецПроцедуры

&НаКлиенте
Процедура СотрудникСправкаОЗаработке(Команда)
	
	Если НЕ СотрудникЗаполнен() Тогда
		Возврат;
	КонецЕсли; 
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьКадровыхПриказовРасширенная", "ПФ_MXL_СправкаОДоходахПроизвольнаяФорма",
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудник), ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура СотрудникСправкаСМестаРаботы(Команда)
	
	Если НЕ СотрудникЗаполнен() Тогда
		Возврат;
	КонецЕсли; 
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьКадровыхПриказовРасширенная", "ПФ_MXL_СправкаСМестаРаботы",
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудник), ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОформитьНаОсновании(Команда)
	
	СотрудникиКлиент.ОформитьНаОсновании(ЭтаФорма, Сотрудник, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиПользователя", "Организация", Организация);
	УстановитьОтборЖурналовПоОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСохраняемойНастройки()
	
	Настройки = СохраняемыеНастройки();
	Настройки.Сотрудник = Сотрудник;
	
	СохранитьНастройкиНаСервере(Настройки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СохраняемыеНастройки()
	
	Настройки = Новый Структура("Сотрудник");
	Возврат Настройки;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьНастройкиНаСервере(Настройки)
	
	Для Каждого КлючИЗначение Из Настройки Цикл
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("РаботаСКадрами", КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборЖурналовПоОрганизации()
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(КадровыеПриказыНеПроведенные.Отбор, "Организация");
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(КадровыеПриказыЗавершенные.Отбор, "Организация");
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(СотрудникиБезОтношений.Отбор, "ГоловнаяОрганизация");
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(СотрудникиСОшибками.Отбор, "ГоловнаяОрганизация");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(КадровыеПриказыНеПроведенные.Отбор, "Организация", Организация);	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(КадровыеПриказыЗавершенные.Отбор, "Организация", Организация);	
	
	ГоловнаяОрганизация = ГоловнаяОрганизация(Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СотрудникиБезОтношений.Отбор, "ГоловнаяОрганизация", ГоловнаяОрганизация);	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СотрудникиСОшибками.Отбор, "ГоловнаяОрганизация", ГоловнаяОрганизация);	
		
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеСотрудника()
	
	ПредставлениеРабочегоМеста = "";
	СотрудникДатаРождения = "";
	СотрудникАдрес = "";
	СотрудникКодПоДРФО = "";
	СотрудникТелефон = "";
	СотрудникДокумент = "";
	СотрудникАдресЭлектроннойПочты = "";
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(КадровыеПриказыСотрудника.Отбор, "Сотрудник");
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(СписочныеДокументыПоСотруднику.Отбор, "Ссылка");
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(КадровыеПриказыСотрудника.Отбор, "Сотрудник", Сотрудник);	
		
		СписочныеДокументыПоСотруднику.ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЖурналДокументовКадровыеДокументы.Ссылка,
			|	ЖурналДокументовКадровыеДокументы.Дата,
			|	ЖурналДокументовКадровыеДокументы.ПометкаУдаления,
			|	ЖурналДокументовКадровыеДокументы.Номер,
			|	ЖурналДокументовКадровыеДокументы.Проведен,
			|	ЖурналДокументовКадровыеДокументы.Организация,
			|	ЖурналДокументовКадровыеДокументы.Сотрудник,
			|	ЖурналДокументовКадровыеДокументы.ДатаСобытия,
			|	ЖурналДокументовКадровыеДокументы.Утвержден,
			|	ЖурналДокументовКадровыеДокументы.Ответственный,
			|	ЖурналДокументовКадровыеДокументы.Комментарий,
			|	ЖурналДокументовКадровыеДокументы.Тип
			|ИЗ
			|	КритерийОтбора.СписочныеДокументыПоСотруднику(&Сотрудник) КАК СписочныеДокументыПоСотруднику
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЖурналДокументов.КадровыеДокументы КАК ЖурналДокументовКадровыеДокументы
			|		ПО СписочныеДокументыПоСотруднику.Ссылка = ЖурналДокументовКадровыеДокументы.Ссылка";
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписочныеДокументыПоСотруднику, "Сотрудник", Сотрудник, Истина);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(КадровыеПриказыСотрудника.Отбор, "Сотрудник", Неопределено);	
		
		СписочныеДокументыПоСотруднику.ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЖурналДокументовКадровыеДокументы.Ссылка,
			|	ЖурналДокументовКадровыеДокументы.Дата,
			|	ЖурналДокументовКадровыеДокументы.ПометкаУдаления,
			|	ЖурналДокументовКадровыеДокументы.Номер,
			|	ЖурналДокументовКадровыеДокументы.Проведен,
			|	ЖурналДокументовКадровыеДокументы.Организация,
			|	ЖурналДокументовКадровыеДокументы.Сотрудник,
			|	ЖурналДокументовКадровыеДокументы.ДатаСобытия,
			|	ЖурналДокументовКадровыеДокументы.Утвержден,
			|	ЖурналДокументовКадровыеДокументы.Ответственный,
			|	ЖурналДокументовКадровыеДокументы.Комментарий,
			|	ЖурналДокументовКадровыеДокументы.Тип
			|ИЗ
			|	ЖурналДокументов.КадровыеДокументы КАК ЖурналДокументовКадровыеДокументы";
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписочныеДокументыПоСотруднику.Отбор, "Ссылка", Неопределено);	
		
	КонецЕсли;
		
	ДатаУвольнения = Неопределено;
	ОформленПоТрудовомуДоговору = Ложь;
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Перечисления.ТипыКонтактнойИнформации.Адрес);
	МассивТипов.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	МассивТипов.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыКонтактнойИнформации.Ссылка,
		|	ВидыКонтактнойИнформации.Тип,
		|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания
		|ПОМЕСТИТЬ ВТВидыКонтактнойИнформации
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|ГДЕ
		|	ВидыКонтактнойИнформации.Тип В(&МассивТипов)
		|	И ВидыКонтактнойИнформации.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СправочникФизическиеЛица)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТВидыКонтактнойИнформации.Ссылка
		|ИЗ
		|	ВТВидыКонтактнойИнформации КАК ВТВидыКонтактнойИнформации
		|ГДЕ
		|	ВТВидыКонтактнойИнформации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТВидыКонтактнойИнформации.Ссылка,
		|	ВТВидыКонтактнойИнформации.РеквизитДопУпорядочивания
		|ИЗ
		|	ВТВидыКонтактнойИнформации КАК ВТВидыКонтактнойИнформации
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТВидыКонтактнойИнформации.Ссылка.РеквизитДопУпорядочивания";
		
	Запрос.УстановитьПараметр("МассивТипов", МассивТипов);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	МассивВидов = РезультатЗапроса[РезультатЗапроса.Количество() - 1].Выгрузить().ВыгрузитьКолонку("Ссылка");
	ВидимостьПоляЭлектронногоАдреса = НЕ РезультатЗапроса[РезультатЗапроса.Количество() - 2].Пустой();
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		НеобходимыеКадровыеДанные = "ФизическоеЛицо,ДатаРождения,ДатаУвольнения,ОформленПоТрудовомуДоговору,КодПоДРФО,ДокументПредставление,ДокументВид,"
			+ "ГоловнаяОрганизация,ТекущаяОрганизация,ТекущееПодразделение,ТекущаяДолжность,ТекущаяДолжностьПоШтатномуРасписанию";
		КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Сотрудник, НеобходимыеКадровыеДанные, ТекущаяДатаСеанса());
		Если КадровыеДанные.Количество() = 0 Тогда
			Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
		Иначе
			
			ИспользоватьНесколькоОрганизаций = ПолучитьФункциональнуюОпциюФормы("ИспользоватьНесколькоОрганизаций");
			
			ДанныеСотрудника = КадровыеДанные[0];
			
			Если ЗначениеЗаполнено(ДанныеСотрудника.ТекущаяОрганизация) Тогда
				
				Если ДанныеСотрудника.ОформленПоТрудовомуДоговору Тогда
					
					Если ПолучитьФункциональнуюОпциюФормы("ИспользоватьШтатноеРасписание") Тогда
						ПредставлениеРабочегоМеста = Строка(ДанныеСотрудника.ТекущаяДолжностьПоШтатномуРасписанию);
					Иначе
						ПредставлениеРабочегоМеста = Строка(ДанныеСотрудника.ТекущаяДолжность)
							+ " /" + Строка(ДанныеСотрудника.ТекущееПодразделение) + "/";
					КонецЕсли; 
					
					Если ИспользоватьНесколькоОрганизаций Тогда
						ПредставлениеРабочегоМеста = ПредставлениеРабочегоМеста + " (" + ДанныеСотрудника.ТекущаяОрганизация + ")";
					КонецЕсли; 
				
				Иначе
					
					ПредставлениеРабочегоМеста = НСтр("ru='Договорник';uk='Договірник'") + " ";
					Если ИспользоватьНесколькоОрганизаций Тогда
						ПредставлениеРабочегоМеста = ПредставлениеРабочегоМеста + " " + ДанныеСотрудника.ТекущаяОрганизация;
					КонецЕсли; 
					
				КонецЕсли;
				
			Иначе
				
				ПредставлениеРабочегоМеста = НСтр("ru='Не оформлен';uk='Не оформлений'");
				Если ИспользоватьНесколькоОрганизаций Тогда
					ПредставлениеРабочегоМеста = ПредставлениеРабочегоМеста + " " + НСтр("ru='в';uk='в'") + " " +  ДанныеСотрудника.ГоловнаяОрганизация;
				КонецЕсли;
				
			КонецЕсли;
			
			ФизическоеЛицо = ДанныеСотрудника.ФизическоеЛицо;
			ДатаУвольнения = ДанныеСотрудника.ДатаУвольнения;
			ОформленПоТрудовомуДоговору = ДанныеСотрудника.ОформленПоТрудовомуДоговору;
			
			Если ЗначениеЗаполнено(ДанныеСотрудника.ДатаРождения) Тогда
				СотрудникДатаРождения = Формат(ДанныеСотрудника.ДатаРождения, "ДЛФ=DD");
			Иначе
				СотрудникДатаРождения = "<" + НСтр("ru='дата рождения не заполнена';uk='дата народження: не заповнено'") + ">";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеСотрудника.КодПоДРФО) Тогда
				СотрудникКодПоДРФО = ДанныеСотрудника.КодПоДРФО;
			Иначе
				СотрудникКодПоДРФО = "<" + НСтр("ru='Код по ДРФО не заполнен';uk='Код за ДРФО не заповнений'") + ">";
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(ДанныеСотрудника.ДокументПредставление) Тогда
				
				СотрудникДокумент = ДанныеСотрудника.ДокументПредставление;
				
				СотрудникДокумент = СтрЗаменить(СотрудникДокумент, НСтр("ru='серия';uk='серія'"), "") + ":";
				СотрудникДокумент = СтрЗаменить(СотрудникДокумент, ", №", "");
				
				СотрудникДокумент = СокрЛП(СотрудникДокумент);
				
			Иначе
				СотрудникДокумент = "<" + НСтр("ru='документ, удостоверяющий личность не заполнен';uk='документ, що засвідчує особу не заповнений'") + ">";
			КонецЕсли;
			
			УправлениеКонтактнойИнформацией.СоздатьВТКонтактнаяИнформация(
				Запрос.МенеджерВременныхТаблиц, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо),
				МассивТипов, МассивВидов);
				
			Запрос.Текст =
				"ВЫБРАТЬ
				|	КонтактнаяИнформация.Тип,
				|	КонтактнаяИнформация.Вид КАК Вид,
				|	КонтактнаяИнформация.Вид.Наименование КАК ВидПредставление,
				|	КонтактнаяИнформация.Представление,
				|	КонтактнаяИнформация.ЗначенияПолей
				|ИЗ
				|	ВТКонтактнаяИнформация КАК КонтактнаяИнформация
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
				|		ПО КонтактнаяИнформация.Вид = ВидыКонтактнойИнформации.Ссылка
				|
				|УПОРЯДОЧИТЬ ПО
				|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания";
				
			ТаблицаКонтактнойИнформации = Запрос.Выполнить().Выгрузить();
			
			СтруктураПоиска = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			НайденныеСтроки = ТаблицаКонтактнойИнформации.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				ЭлектронныйАдрес = НайденныеСтроки[0].Представление;

				СотрудникАдресЭлектроннойПочты = ПредставлениеКонтактнойИнформации(
					НайденныеСтроки[0].Представление,
					НайденныеСтроки[0].ВидПредставление,
					Строка(НайденныеСтроки[0].Тип));
					
			Иначе
				ЭлектронныйАдрес = "";
				СотрудникАдресЭлектроннойПочты = "<" + НСтр("ru='адрес электронной почты не заполнен';uk='адреса електронної пошти не заповнена'") + ">";
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы,
				"СотрудникАдресЭлектроннойПочты",
				"Гиперссылка",
				НЕ ПустаяСтрока(ЭлектронныйАдрес));
			
			СтруктураПоиска = Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица);
			НайденныеСтроки = ТаблицаКонтактнойИнформации.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				СотрудникТелефон = НайденныеСтроки[0].Представление;
			Иначе
				
				СтруктураПоиска = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
				НайденныеСтроки = ТаблицаКонтактнойИнформации.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтроки.Количество() > 0 Тогда
				
					СотрудникТелефон = ПредставлениеКонтактнойИнформации(
						НайденныеСтроки[0].Представление,
						НайденныеСтроки[0].ВидПредставление,
						Строка(НайденныеСтроки[0].Тип));

				Иначе
					СотрудникТелефон = "<" + НСтр("ru='телефон не заполнен';uk='телефон не заповнений'") + ">";
				КонецЕсли;
				
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
			НайденныеСтроки = ТаблицаКонтактнойИнформации.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				СотрудникАдрес = НайденныеСтроки[0].Представление;
			Иначе
				
				СтруктураПоиска = Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
				НайденныеСтроки = ТаблицаКонтактнойИнформации.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтроки.Количество() > 0 Тогда
				
					СотрудникАдрес = ПредставлениеКонтактнойИнформации(
						НайденныеСтроки[0].Представление,
						НайденныеСтроки[0].ВидПредставление,
						Строка(НайденныеСтроки[0].Тип));

				Иначе
					СотрудникАдрес = "<" + НСтр("ru='адрес не заполнен';uk='адреса не заповнена'") + ">";
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ГруппаВсеДанныеСотрудника",
			"Доступность",
			Истина);
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ОформитьУвольнение",
			"Видимость",
			ОформленПоТрудовомуДоговору И НЕ ЗначениеЗаполнено(ДатаУвольнения));
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"СотрудникАдресЭлектроннойПочты",
			"Видимость",
			ВидимостьПоляЭлектронногоАдреса);
			
		ПараметрыПостроения = Новый Структура;
		ПараметрыПостроения.Вставить("Сотрудник", Сотрудник);
		ПараметрыПостроения.Вставить("ОформленПоТрудовомуДоговору", ОформленПоТрудовомуДоговору);
		ПараметрыПостроения.Вставить("ДатаУвольнения", ДатаУвольнения);
		
		СотрудникиФормы.УстановитьМенюВводаНаОсновании(ЭтаФорма, "ОформитьДокумент", ПараметрыПостроения);
		
	Иначе
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ГруппаВсеДанныеСотрудника",
			"Доступность",
			Ложь);
			
	КонецЕсли;
	
	ЗарплатаКадрыКлиентСервер.УстановитьРасширеннуюПодсказкуЭлементуФормы(
		ЭтаФорма,
		"Сотрудник",
		ПредставлениеРабочегоМеста);
			
КонецПроцедуры

&НаСервере
Функция ПредставлениеКонтактнойИнформации(Представление, ВидПредставление, ТипПредставление)
	
	Если СтрНайти(ВидПредставление, ТипПредставление) = 1 Тогда
		ПредставлениеВида = СокрЛП(Сред(ВидПредставление, СтрДлина(ТипПредставление) + 1));
	Иначе
		ПредставлениеВида = ВидПредставление;
	КонецЕсли;
	
	Возврат Представление + " (" + ПредставлениеВида + ")";
		
КонецФункции

&НаСервере
Функция ГоловнаяОрганизация(Организация)
	УстановитьПривилегированныйРежим(Истина);
	Возврат РегламентированнаяОтчетность.ГоловнаяОрганизация(Организация);
КонецФункции

&НаСервере
Процедура ОтправитьСотрудникаВАрхивНаСервере()
	
	Если Элементы.СотрудникиБезОтношений.ТекущаяСтрока <> Неопределено Тогда
		
		СотрудникОбъект = Элементы.СотрудникиБезОтношений.ТекущаяСтрока.ПолучитьОбъект();
		
		Попытка 
			СотрудникОбъект.Заблокировать();
		Исключение
			ТекстИсключенияЗаписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не удалось изменить данные сотрудника ""%1"".
            |Возможно, сотрудник редактируется другим пользователем'
            |;uk='Не вдалося змінити дані співробітника ""%1"".
            |Можливо, співробітник редагується іншим користувачем'"),
			СотрудникОбъект.Наименование);			
			ВызватьИсключение ТекстИсключенияЗаписи;
		КонецПопытки;
		
		СотрудникОбъект.ВАрхиве = Истина;
		СотрудникОбъект.Записать();
		
		ОбновитьСписки(ЭтаФорма, Истина, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСписки(Форма, СпискиСотрудников, СпискиДокументов)
	
	Если  СпискиСотрудников Тогда
		Форма.Элементы.СотрудникиБезОтношений.Обновить();
		Форма.Элементы.СотрудникиСОшибками.Обновить();
	КонецЕсли;
	
	Если СпискиДокументов Тогда
		Форма.Элементы.КадровыеПриказыСотрудника.Обновить();
		Форма.Элементы.КадровыеПриказыЗавершенные.Обновить();
		Форма.Элементы.КадровыеПриказыНеПроведенные.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СотрудникЗаполнен()
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		
		ПоказатьПредупреждение(, НСтр("ru='Выберите сотрудника';uk='Виберіть співробітника'"));
		Возврат Ложь;
		
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
